# GetBeamIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
BeamSystem..::..GetBeamIds Method
BeamSystem Class See Also
---
Gets all the beams of the BeamSystem.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> GetBeamIds()
```

Visual Basic
---
```text
Public Function GetBeamIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetBeamIds()
```

# ### Return Value
The beam Ids.
# See Also
BeamSystem Class
Autodesk.Revit.DB Namespace